---
type: StructuralSectionGeneralU
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 7
tags: [revit-api, class]
---

# StructuralSectionGeneralU

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionGeneralU | 2018 | `public StructuralSectionGeneralU ( double width , double height , double flangeThickness , double flangeThicknessLocation , double flangeFillet , double flangeToeOfFillet , double slopedFlangeAngle , double webThickness ` |
| Method | GetFlangeThicknessInFlangeCenter | 2018 | `public double GetFlangeThicknessInFlangeCenter ()` |
| Method | GetFlangeThicknessInWidthCenter | 2018 | `public double GetFlangeThicknessInWidthCenter ()` |
| Property | FlangeFillet | 2018 | `public double FlangeFillet { get ; set ; }` |
| Property | FlangeToeOfFillet | 2018 | `public double FlangeToeOfFillet { get ; set ; }` |
| Property | SlopedFlangeAngle | 2018 | `public double SlopedFlangeAngle { get ; set ; }` |
| Property | WebToeOfFillet | 2018 | `public double WebToeOfFillet { get ; set ; }` |